backend/Rant/app/controllers/posts_controller.rb

    def index
        # binding.pry
        render json: Post.all, key_transformation: :camel_lower
---
SELECT "posts".* FROM "posts"

    def create
        post = Post.create(post_params)
---
INSERT INTO "posts" ("id", "text", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["id", 8], ["text", "Jinook and Eva are wonderful"], ["author", "me"], ["created_at", "2021-06-02 22:57:06.832377"], ["updated_at", "2021-06-02 22:57:06.832377"]]

    def destroy
        p = Post.find_by_id(params[:id])
        p.destroy
        render json: Post.all, key_transformation: :camel_lower
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 464], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 464]]
SELECT "posts".* FROM "posts"